spec/dummy/app/controllers/csv_imports/companies_controller.rb

    def import
      if csv_import.save
---
INSERT INTO "csv_imports" ("created_at", "file", "state", "type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 03 Apr 2014 09:12:10 UTC +00:00], ["file", "companies_sample.csv"], ["state", "pending"], ["type", "CsvImports::Company"], ["updated_at", Thu, 03 Apr 2014 09:12:10 UTC +00:00]]
UPDATE "csv_imports" SET "total_count" = ?, "updated_at" = ? WHERE "csv_imports"."type" IN ('CsvImports::Company') AND "csv_imports"."id" = 1  [["total_count", 1], ["updated_at", Thu, 03 Apr 2014 09:12:10 UTC +00:00]]